app/controllers/bouquets_controller.rb

  def all
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def locations
    locations = []
    user = User.find(current_user.id)
    bouquets = user.sent_bouquets.order("created_at")
    bouquets.each do |bouquet|
      locations << Location.find(bouquet.location_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @song = Song.find_or_create_by(song_params)
    @location = Location.find_or_create_by(location_params)
    @bouquet = Bouquet.new(bouquet_params)
    @bouquet.sender_id = current_user.id
    @bouquet.location_id = @location.id
    @bouquet.song_id = @song.id
    if @bouquet.save
---
INSERT INTO "songs" ("artist", "album", "track", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "The Avett Brothers"], ["album", "I And Love And You"], ["track", "I And Love And You"], ["created_at", "2017-08-20 18:53:14.705468"], ["updated_at", "2017-08-20 18:53:14.705468"]]
INSERT INTO "locations" ("lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["lat", 30], ["lng", -97], ["created_at", "2017-08-20 18:53:14.719044"], ["updated_at", "2017-08-20 18:53:14.719044"]]
INSERT INTO "bouquets" ("sender_name", "receiver_name", "sender_id", "song_id", "custom_location", "location_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def confirm
    @bouquet = Bouquet.find(params[:id])
    @location = Location.find(@bouquet.location_id)
---
SELECT  "bouquets".* FROM "bouquets" WHERE "bouquets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def show
    @bouquet = Bouquet.find(params[:id])
    if current_user.id == @bouquet.sender_id || params[:secret] == @bouquet.secret
      @location = Location.find(@bouquet.location_id)
---
SELECT  "bouquets".* FROM "bouquets" WHERE "bouquets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]